<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="4" name="dec_st_h" type="Parameter" version="opset1">
			<data shape="1,512" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dec_st_h"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="dec_st_h">
					<dim>1</dim>
					<dim>512</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,D]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="3" name="dec_st_c" type="Parameter" version="opset1">
			<data shape="1,512" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dec_st_c"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="dec_st_c">
					<dim>1</dim>
					<dim>512</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,D]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="2" name="output_prev" type="Parameter" version="opset1">
			<data shape="1,256" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="output_prev"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="output_prev">
					<dim>1</dim>
					<dim>256</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="row_enc_out" type="Parameter" version="opset1">
			<data shape="1,6,62,512" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="row_enc_out"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="row_enc_out">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,H,W,D]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="tgt" type="Parameter" version="opset1">
			<data shape="1,1" element_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="tgt"/>
				<attribute name="old_api_map_element_type" version="0" value="i32"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="tgt">
					<dim>1</dim>
					<dim>1</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,D]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="5" name="model.head.rnn_decoder.weight_hh" type="Const" version="opset1">
			<data element_type="f32" shape="2048, 512" offset="0" size="4194304"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model.head.rnn_decoder.weight_hh"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model.head.rnn_decoder.weight_hh">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="MatMul_294" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MatMul_294"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_2932" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2048" offset="4194304" size="8192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="290" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="290, Multiply_295"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="290">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model.head.embedding.weight" type="Const" version="opset1">
			<data element_type="f32" shape="47, 80" offset="4202496" size="15040"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model.head.embedding.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model.head.embedding.weight">
					<dim>47</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_287" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4217536" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_287"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="11" name="287" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="287"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>47</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="287">
					<dim>1</dim>
					<dim>1</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_289" type="Const" version="opset1">
			<data element_type="u64" shape="1" offset="4217544" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_289"/>
			</rt_info>
			<output>
				<port id="0" precision="U64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="288" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="288"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="U64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="288">
					<dim>1</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="289" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="289"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="289">
					<dim>1</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model.head.rnn_decoder.weight_ih" type="Const" version="opset1">
			<data element_type="f32" shape="2048, 336" offset="4217552" size="2752512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model.head.rnn_decoder.weight_ih"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model.head.rnn_decoder.weight_ih">
					<dim>2048</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="MatMul_299" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MatMul_299"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_2933" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2048" offset="6970064" size="8192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="291" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="291, Multiply_300"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="291">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="292" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="292"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="292">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_303" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4217544" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_303"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="21" name="Constant_304" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="6978256" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_304"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="296" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="296"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="293">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="4" precision="FP32" names="294">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="5" precision="FP32" names="295">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="6" precision="FP32" names="296">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="300" type="Sigmoid" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="300"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="300">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="298" type="Sigmoid" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="298"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="298">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="301" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="301"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="301">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="297" type="Sigmoid" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="297"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="297">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="299" type="Tanh" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="299"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="299">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="302" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="302"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="302">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="dec_st_c_t" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dec_st_c_t"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dec_st_c_t">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="304" type="Tanh" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="304"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="304">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="dec_st_h_t" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dec_st_h_t"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dec_st_h_t">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_2936" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 512" offset="6978288" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model.head.W_h.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="6980336" size="1048576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model.head.W_h.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model.head.W_h.weight">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="MatMul_329" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MatMul_329"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_2934" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512" offset="8028912" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="315" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="315, Multiply_330"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="315">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="306" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="306, 309, 312"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="306,309,312">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_2477" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4217536" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="307, 308, 324, Constant_317, Constant_342"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_317" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4217536" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_317"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="40" name="308" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="307, 308, 324, Constant_317, Constant_342"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="324">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="325" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4217544" size="8"/>
			<output>
				<port id="0" precision="I64" names="325">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="326" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4217544" size="8"/>
			<output>
				<port id="0" precision="I64" names="326">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="319" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="316, 319"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="316,319">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_2486" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4217544" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="320, 321, 327, Constant_338, Constant_348"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_338" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4217536" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_338"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="46" name="321" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="320, 321, 327, Constant_338, Constant_348"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="327">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="328" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="325, 326, 328"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="328">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="329" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="329"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="329">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_2495" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4217536" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="317, 318, 330, Constant_334, Constant_411"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_334" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4217536" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_334"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="51" name="318" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="317, 318, 330, Constant_334, Constant_411"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="330">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_2561" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="8030960" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="334"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_2562" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4217536" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="54" name="Gather_2563" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="334"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_2522" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4217544" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="320, 321, 333, Constant_338, Constant_417"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="3210" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="320, 321, 333, Constant_338, Constant_417"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="333">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="334" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="334"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="334">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="335" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="335"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="335">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_2886" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512" offset="8030976" size="1048576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="336, 337"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="337" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="336, 337"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="337">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_2935" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 512" offset="9079552" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="338" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="338"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="338">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="339" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="339"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="339">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="340" type="Tanh" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="340"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="340">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="341" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="341"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="341">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_505" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="9081600" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_505"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="342" type="ReduceSum" version="opset1">
			<data keep_dims="false"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="342"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="342">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_2531" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4217536" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="307, 308, 344, Constant_317, Constant_508"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="3080" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="307, 308, 344, Constant_317, Constant_508"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="344">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="345" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="9081600" size="8"/>
			<output>
				<port id="0" precision="I64" names="345">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="346" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="345, 346"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="346">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="347" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="347"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="347">
					<dim>1</dim>
					<dim>372</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="348" type="SoftMax" version="opset8">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="348"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>372</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="348">
					<dim>1</dim>
					<dim>372</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_2570" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="9081608" size="24"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="352"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_2571" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4217536" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="76" name="Gather_2572" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="352"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="352">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="353" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="353"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>372</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="353">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_614" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="9081600" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_614"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="354" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="354"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="354">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="355" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="355"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="355">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_617" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="8030960" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_617"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="356" type="ReduceSum" version="opset1">
			<data keep_dims="false"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="356"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>62</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="356">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="357" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="357"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="357">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model.head.W_c.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1024" offset="9081632" size="1048576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model.head.W_c.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model.head.W_c.weight">
					<dim>256</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="MatMul_622" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MatMul_622"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_2937" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="10130208" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="358" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="358, Multiply_623"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="358">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="output" type="Tanh" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="output"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="output">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="model.head.W_out.weight" type="Const" version="opset1">
			<data element_type="f32" shape="47, 256" offset="10131232" size="48128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="model.head.W_out.weight"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="model.head.W_out.weight">
					<dim>47</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="MatMul_628" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="MatMul_628"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>47</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>47</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_2938" type="Const" version="opset1">
			<data element_type="f32" shape="1, 47" offset="10179360" size="188"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>47</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="360" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="360, Multiply_629"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>47</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>47</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="360">
					<dim>1</dim>
					<dim>47</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="logit" type="SoftMax" version="opset8">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="logit"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>47</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="logit">
					<dim>1</dim>
					<dim>47</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="dec_st_h_t/sink_port_0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="dec_st_h_t/sink_port_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
		</layer>
		<layer id="96" name="dec_st_c_t/sink_port_0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="dec_st_c_t/sink_port_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
		</layer>
		<layer id="95" name="output/sink_port_0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="output/sink_port_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
		</layer>
		<layer id="94" name="logit/sink_port_0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="logit/sink_port_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>47</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="11" to-port="1"/>
		<edge from-layer="1" from-port="0" to-layer="60" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="80" to-port="1"/>
		<edge from-layer="1" from-port="0" to-layer="37" to-port="0"/>
		<edge from-layer="2" from-port="0" to-layer="14" to-port="1"/>
		<edge from-layer="3" from-port="0" to-layer="25" to-port="1"/>
		<edge from-layer="4" from-port="0" to-layer="6" to-port="0"/>
		<edge from-layer="4" from-port="0" to-layer="34" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="19" to-port="0"/>
		<edge from-layer="9" from-port="0" to-layer="11" to-port="0"/>
		<edge from-layer="10" from-port="0" to-layer="11" to-port="2"/>
		<edge from-layer="11" from-port="3" to-layer="13" to-port="0"/>
		<edge from-layer="12" from-port="0" to-layer="13" to-port="1"/>
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="0" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="20" from-port="0" to-layer="22" to-port="1"/>
		<edge from-layer="21" from-port="0" to-layer="22" to-port="2"/>
		<edge from-layer="22" from-port="3" to-layer="26" to-port="0"/>
		<edge from-layer="22" from-port="5" to-layer="27" to-port="0"/>
		<edge from-layer="22" from-port="4" to-layer="24" to-port="0"/>
		<edge from-layer="22" from-port="6" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="31" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="2" to-layer="29" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="29" to-port="1"/>
		<edge from-layer="29" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="2" to-layer="96" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="31" to-port="1"/>
		<edge from-layer="31" from-port="2" to-layer="83" to-port="0"/>
		<edge from-layer="31" from-port="2" to-layer="97" to-port="0"/>
		<edge from-layer="32" from-port="0" to-layer="65" to-port="0"/>
		<edge from-layer="33" from-port="0" to-layer="34" to-port="1"/>
		<edge from-layer="34" from-port="2" to-layer="36" to-port="0"/>
		<edge from-layer="35" from-port="0" to-layer="36" to-port="1"/>
		<edge from-layer="36" from-port="2" to-layer="43" to-port="0"/>
		<edge from-layer="36" from-port="2" to-layer="48" to-port="0"/>
		<edge from-layer="37" from-port="1" to-layer="40" to-port="0"/>
		<edge from-layer="37" from-port="1" to-layer="76" to-port="0"/>
		<edge from-layer="37" from-port="1" to-layer="69" to-port="0"/>
		<edge from-layer="37" from-port="1" to-layer="54" to-port="0"/>
		<edge from-layer="38" from-port="0" to-layer="40" to-port="1"/>
		<edge from-layer="39" from-port="0" to-layer="69" to-port="2"/>
		<edge from-layer="39" from-port="0" to-layer="40" to-port="2"/>
		<edge from-layer="40" from-port="3" to-layer="47" to-port="0"/>
		<edge from-layer="41" from-port="0" to-layer="47" to-port="1"/>
		<edge from-layer="42" from-port="0" to-layer="47" to-port="2"/>
		<edge from-layer="43" from-port="1" to-layer="46" to-port="0"/>
		<edge from-layer="43" from-port="1" to-layer="56" to-port="0"/>
		<edge from-layer="43" from-port="1" to-layer="51" to-port="0"/>
		<edge from-layer="44" from-port="0" to-layer="46" to-port="1"/>
		<edge from-layer="45" from-port="0" to-layer="56" to-port="2"/>
		<edge from-layer="45" from-port="0" to-layer="46" to-port="2"/>
		<edge from-layer="46" from-port="3" to-layer="47" to-port="3"/>
		<edge from-layer="47" from-port="4" to-layer="48" to-port="1"/>
		<edge from-layer="48" from-port="2" to-layer="58" to-port="0"/>
		<edge from-layer="49" from-port="0" to-layer="51" to-port="1"/>
		<edge from-layer="50" from-port="0" to-layer="51" to-port="2"/>
		<edge from-layer="51" from-port="3" to-layer="57" to-port="0"/>
		<edge from-layer="52" from-port="0" to-layer="54" to-port="1"/>
		<edge from-layer="53" from-port="0" to-layer="54" to-port="2"/>
		<edge from-layer="54" from-port="3" to-layer="57" to-port="1"/>
		<edge from-layer="55" from-port="0" to-layer="56" to-port="1"/>
		<edge from-layer="56" from-port="3" to-layer="57" to-port="2"/>
		<edge from-layer="57" from-port="3" to-layer="58" to-port="1"/>
		<edge from-layer="58" from-port="2" to-layer="63" to-port="0"/>
		<edge from-layer="59" from-port="0" to-layer="60" to-port="1"/>
		<edge from-layer="60" from-port="2" to-layer="62" to-port="0"/>
		<edge from-layer="61" from-port="0" to-layer="62" to-port="1"/>
		<edge from-layer="62" from-port="2" to-layer="63" to-port="1"/>
		<edge from-layer="63" from-port="2" to-layer="64" to-port="0"/>
		<edge from-layer="64" from-port="1" to-layer="65" to-port="1"/>
		<edge from-layer="65" from-port="2" to-layer="67" to-port="0"/>
		<edge from-layer="66" from-port="0" to-layer="67" to-port="1"/>
		<edge from-layer="67" from-port="2" to-layer="72" to-port="0"/>
		<edge from-layer="68" from-port="0" to-layer="69" to-port="1"/>
		<edge from-layer="69" from-port="3" to-layer="71" to-port="0"/>
		<edge from-layer="70" from-port="0" to-layer="71" to-port="1"/>
		<edge from-layer="71" from-port="2" to-layer="72" to-port="1"/>
		<edge from-layer="72" from-port="2" to-layer="73" to-port="0"/>
		<edge from-layer="73" from-port="1" to-layer="77" to-port="0"/>
		<edge from-layer="74" from-port="0" to-layer="76" to-port="1"/>
		<edge from-layer="75" from-port="0" to-layer="76" to-port="2"/>
		<edge from-layer="76" from-port="3" to-layer="77" to-port="1"/>
		<edge from-layer="77" from-port="2" to-layer="79" to-port="0"/>
		<edge from-layer="78" from-port="0" to-layer="79" to-port="1"/>
		<edge from-layer="79" from-port="2" to-layer="80" to-port="0"/>
		<edge from-layer="80" from-port="2" to-layer="82" to-port="0"/>
		<edge from-layer="81" from-port="0" to-layer="82" to-port="1"/>
		<edge from-layer="82" from-port="2" to-layer="83" to-port="1"/>
		<edge from-layer="83" from-port="2" to-layer="85" to-port="0"/>
		<edge from-layer="84" from-port="0" to-layer="85" to-port="1"/>
		<edge from-layer="85" from-port="2" to-layer="87" to-port="0"/>
		<edge from-layer="86" from-port="0" to-layer="87" to-port="1"/>
		<edge from-layer="87" from-port="2" to-layer="88" to-port="0"/>
		<edge from-layer="88" from-port="1" to-layer="90" to-port="0"/>
		<edge from-layer="88" from-port="1" to-layer="95" to-port="0"/>
		<edge from-layer="89" from-port="0" to-layer="90" to-port="1"/>
		<edge from-layer="90" from-port="2" to-layer="92" to-port="0"/>
		<edge from-layer="91" from-port="0" to-layer="92" to-port="1"/>
		<edge from-layer="92" from-port="2" to-layer="93" to-port="0"/>
		<edge from-layer="93" from-port="1" to-layer="94" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2022.1.0-6910-173f328c53d"/>
		<Runtime_version value="2022.1.0-6910-173f328c53d"/>
		<legacy_path value="False"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<compress_fp16 value="False"/>
			<data_type value="FP32"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
