<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="imgs" type="Parameter" version="opset1">
			<data shape="1,3,160,1400" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="imgs"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="imgs">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>1400</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]"/>
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="Multiply_12223" type="Const" version="opset1">
			<data element_type="f32" shape="64, 3, 7, 7" offset="0" size="37632"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Multiply_12042" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="169, 170, Constant_2104, Divide_2105, model.cnn_encoder.bn1.bias, model.cnn_encoder.bn1.running_mean, model.cnn_encoder.bn1.running_var, model.cnn_encoder.bn1.weight, model.cnn_encoder.conv1.weight"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>1400</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>700</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_12047" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="37632" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="170" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="170, model.cnn_encoder.bn1.bias, model.cnn_encoder.bn1.running_mean, model.cnn_encoder.bn1.running_var, model.cnn_encoder.bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>700</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="170">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>700</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="171" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="171"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>700</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="171">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>700</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="172" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" kernel="3, 3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="172"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>700</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="172">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Multiply_12232" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 1, 1" offset="37888" size="32768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Multiply_12049" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="173, 174, model.cnn_encoder.layer1.0.bn1.bias, model.cnn_encoder.layer1.0.bn1.running_mean, model.cnn_encoder.layer1.0.bn1.running_var, model.cnn_encoder.layer1.0.bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_12054" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="70656" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="174" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="174, model.cnn_encoder.layer1.0.bn1.bias, model.cnn_encoder.layer1.0.bn1.running_mean, model.cnn_encoder.layer1.0.bn1.running_var, model.cnn_encoder.layer1.0.bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="174">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="175" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="175"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="175">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Multiply_12241" type="Const" version="opset1">
			<data element_type="f32" shape="32, 4, 4, 3, 3" offset="71168" size="18432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Multiply_12056" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="177, model.cnn_encoder.layer1.0.bn2.bias, model.cnn_encoder.layer1.0.bn2.running_mean, model.cnn_encoder.layer1.0.bn2.running_var, model.cnn_encoder.layer1.0.bn2.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="176">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_12061" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="89600" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="177" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="177, model.cnn_encoder.layer1.0.bn2.bias, model.cnn_encoder.layer1.0.bn2.running_mean, model.cnn_encoder.layer1.0.bn2.running_var, model.cnn_encoder.layer1.0.bn2.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="177">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="178" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="178"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="178">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Multiply_12249" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 1, 1" offset="90112" size="131072"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Multiply_12063" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="179, 180, model.cnn_encoder.layer1.0.bn3.bias, model.cnn_encoder.layer1.0.bn3.running_mean, model.cnn_encoder.layer1.0.bn3.running_var, model.cnn_encoder.layer1.0.bn3.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_12068" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="221184" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="180" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="180, model.cnn_encoder.layer1.0.bn3.bias, model.cnn_encoder.layer1.0.bn3.running_mean, model.cnn_encoder.layer1.0.bn3.running_var, model.cnn_encoder.layer1.0.bn3.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="180">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Multiply_12258" type="Const" version="opset1">
			<data element_type="f32" shape="256, 64, 1, 1" offset="222208" size="65536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Multiply_12070" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="181, 182, model.cnn_encoder.layer1.0.downsample.1.bias, model.cnn_encoder.layer1.0.downsample.1.running_mean, model.cnn_encoder.layer1.0.downsample.1.running_var, model.cnn_encoder.layer1.0.downsample.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_12075" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="287744" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="182" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="182, model.cnn_encoder.layer1.0.downsample.1.bias, model.cnn_encoder.layer1.0.downsample.1.running_mean, model.cnn_encoder.layer1.0.downsample.1.running_var, model.cnn_encoder.layer1.0.downsample.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="182">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="183" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="183"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="183">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="184" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="184"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="184">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Multiply_12267" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256, 1, 1" offset="288768" size="131072"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Multiply_12077" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="185, 186, model.cnn_encoder.layer1.1.bn1.bias, model.cnn_encoder.layer1.1.bn1.running_mean, model.cnn_encoder.layer1.1.bn1.running_var, model.cnn_encoder.layer1.1.bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_12082" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="419840" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="186" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="186, model.cnn_encoder.layer1.1.bn1.bias, model.cnn_encoder.layer1.1.bn1.running_mean, model.cnn_encoder.layer1.1.bn1.running_var, model.cnn_encoder.layer1.1.bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="186">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="187" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="187"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="187">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Multiply_12276" type="Const" version="opset1">
			<data element_type="f32" shape="32, 4, 4, 3, 3" offset="420352" size="18432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Multiply_12084" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="189, model.cnn_encoder.layer1.1.bn2.bias, model.cnn_encoder.layer1.1.bn2.running_mean, model.cnn_encoder.layer1.1.bn2.running_var, model.cnn_encoder.layer1.1.bn2.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="188">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_12089" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="438784" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="189" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="189, model.cnn_encoder.layer1.1.bn2.bias, model.cnn_encoder.layer1.1.bn2.running_mean, model.cnn_encoder.layer1.1.bn2.running_var, model.cnn_encoder.layer1.1.bn2.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="189">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="190" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="190"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="190">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Multiply_12284" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 1, 1" offset="439296" size="131072"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Multiply_12091" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="191, 192, model.cnn_encoder.layer1.1.bn3.bias, model.cnn_encoder.layer1.1.bn3.running_mean, model.cnn_encoder.layer1.1.bn3.running_var, model.cnn_encoder.layer1.1.bn3.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_12096" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="570368" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="192" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="192, model.cnn_encoder.layer1.1.bn3.bias, model.cnn_encoder.layer1.1.bn3.running_mean, model.cnn_encoder.layer1.1.bn3.running_var, model.cnn_encoder.layer1.1.bn3.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="192">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="193" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="193"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="193">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="194" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="194"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="194">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Multiply_12293" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256, 1, 1" offset="571392" size="131072"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Multiply_12098" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="195, 196, model.cnn_encoder.layer1.2.bn1.bias, model.cnn_encoder.layer1.2.bn1.running_mean, model.cnn_encoder.layer1.2.bn1.running_var, model.cnn_encoder.layer1.2.bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_12103" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="702464" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="196" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="196, model.cnn_encoder.layer1.2.bn1.bias, model.cnn_encoder.layer1.2.bn1.running_mean, model.cnn_encoder.layer1.2.bn1.running_var, model.cnn_encoder.layer1.2.bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="196">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="197" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="197"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="197">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Multiply_12302" type="Const" version="opset1">
			<data element_type="f32" shape="32, 4, 4, 3, 3" offset="702976" size="18432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Multiply_12105" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="199, model.cnn_encoder.layer1.2.bn2.bias, model.cnn_encoder.layer1.2.bn2.running_mean, model.cnn_encoder.layer1.2.bn2.running_var, model.cnn_encoder.layer1.2.bn2.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="198">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_12110" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="721408" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="199" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="199, model.cnn_encoder.layer1.2.bn2.bias, model.cnn_encoder.layer1.2.bn2.running_mean, model.cnn_encoder.layer1.2.bn2.running_var, model.cnn_encoder.layer1.2.bn2.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="199">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="200" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="200"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="200">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Multiply_12310" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 1, 1" offset="721920" size="131072"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Multiply_12112" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="201, 202, model.cnn_encoder.layer1.2.bn3.bias, model.cnn_encoder.layer1.2.bn3.running_mean, model.cnn_encoder.layer1.2.bn3.running_var, model.cnn_encoder.layer1.2.bn3.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_12117" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="852992" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="202" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="202, model.cnn_encoder.layer1.2.bn3.bias, model.cnn_encoder.layer1.2.bn3.running_mean, model.cnn_encoder.layer1.2.bn3.running_var, model.cnn_encoder.layer1.2.bn3.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="202">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="203" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="203"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="203">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="204" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="204"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="204">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Multiply_12319" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1, 1" offset="854016" size="262144"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Multiply_12119" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="205, 206, model.cnn_encoder.layer2.0.bn1.bias, model.cnn_encoder.layer2.0.bn1.running_mean, model.cnn_encoder.layer2.0.bn1.running_var, model.cnn_encoder.layer2.0.bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_12124" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="1116160" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="206" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="206, model.cnn_encoder.layer2.0.bn1.bias, model.cnn_encoder.layer2.0.bn1.running_mean, model.cnn_encoder.layer2.0.bn1.running_var, model.cnn_encoder.layer2.0.bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="206">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="207" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="207"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="207">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Multiply_12328" type="Const" version="opset1">
			<data element_type="f32" shape="32, 8, 8, 3, 3" offset="1117184" size="73728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Multiply_12126" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="209, model.cnn_encoder.layer2.0.bn2.bias, model.cnn_encoder.layer2.0.bn2.running_mean, model.cnn_encoder.layer2.0.bn2.running_var, model.cnn_encoder.layer2.0.bn2.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="208">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_12131" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="1190912" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="209" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="209, model.cnn_encoder.layer2.0.bn2.bias, model.cnn_encoder.layer2.0.bn2.running_mean, model.cnn_encoder.layer2.0.bn2.running_var, model.cnn_encoder.layer2.0.bn2.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="209">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="210" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="210"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="210">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Multiply_12336" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 1, 1" offset="1191936" size="524288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Multiply_12133" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="211, 212, model.cnn_encoder.layer2.0.bn3.bias, model.cnn_encoder.layer2.0.bn3.running_mean, model.cnn_encoder.layer2.0.bn3.running_var, model.cnn_encoder.layer2.0.bn3.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_12138" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="1716224" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="212" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="212, model.cnn_encoder.layer2.0.bn3.bias, model.cnn_encoder.layer2.0.bn3.running_mean, model.cnn_encoder.layer2.0.bn3.running_var, model.cnn_encoder.layer2.0.bn3.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="212">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Multiply_12345" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 1, 1" offset="1718272" size="524288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Multiply_12140" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="213, 214, model.cnn_encoder.layer2.0.downsample.1.bias, model.cnn_encoder.layer2.0.downsample.1.running_mean, model.cnn_encoder.layer2.0.downsample.1.running_var, model.cnn_encoder.layer2.0.downsample.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>40</dim>
					<dim>350</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_12145" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="2242560" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="214" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="214, model.cnn_encoder.layer2.0.downsample.1.bias, model.cnn_encoder.layer2.0.downsample.1.running_mean, model.cnn_encoder.layer2.0.downsample.1.running_var, model.cnn_encoder.layer2.0.downsample.1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="214">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="215" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="215"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="215">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="216" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="216"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="216">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Multiply_12354" type="Const" version="opset1">
			<data element_type="f32" shape="256, 512, 1, 1" offset="2244608" size="524288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Multiply_12147" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="217, 218, model.cnn_encoder.layer2.1.bn1.bias, model.cnn_encoder.layer2.1.bn1.running_mean, model.cnn_encoder.layer2.1.bn1.running_var, model.cnn_encoder.layer2.1.bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_12152" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="2768896" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="218" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="218, model.cnn_encoder.layer2.1.bn1.bias, model.cnn_encoder.layer2.1.bn1.running_mean, model.cnn_encoder.layer2.1.bn1.running_var, model.cnn_encoder.layer2.1.bn1.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="218">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="219" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="219"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="219">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Multiply_12363" type="Const" version="opset1">
			<data element_type="f32" shape="32, 8, 8, 3, 3" offset="2769920" size="73728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Multiply_12154" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="221, model.cnn_encoder.layer2.1.bn2.bias, model.cnn_encoder.layer2.1.bn2.running_mean, model.cnn_encoder.layer2.1.bn2.running_var, model.cnn_encoder.layer2.1.bn2.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="220">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_12159" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="2843648" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="221" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="221, model.cnn_encoder.layer2.1.bn2.bias, model.cnn_encoder.layer2.1.bn2.running_mean, model.cnn_encoder.layer2.1.bn2.running_var, model.cnn_encoder.layer2.1.bn2.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="221">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="222" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="222"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="222">
					<dim>1</dim>
					<dim>256</dim>
					<dim>20</dim>
					<dim>175</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Multiply_12371" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 1, 1" offset="2844672" size="524288"/>
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Multiply_12161" type="Convolution" version="opset1">
